[
  {
    "title": "Hajj (Meeqat)",
    "day": "0",
    "date": "",
    "sub_title": "Dhu’l-Hulayfah",
    "desc": "The Mīqāt Dhu al-Ḥulayfah (Arabic: مِيْقَات ذُو ٱلْحُلَيْفَة), also known as Masjid ash-Shajarah (Arabic: مَسْجِد ٱلشَّجَرَة, lit.'Mosque of the Tree') or Masjid Dhu al-Hulayfah (Arabic: مَسْجِد ذُو ٱلْحُلَيْفَة), is a miqat and mosque in Abyār ʿAlī, Medina, west of Wadi al-'Aqiq, believed by Muslims to be the location where the final Islamic prophet, Muhammad, entered the state of ihram before performing 'Umrah, after the Treaty of Hudaybiyyah.",
    "sub_desc": "This is a Meeqat point for pilgrims who are coming towards Haram from Madinah. Anyone who follows the same enrooted to Mecca from anywhere should wear Ihram before reaching this point. The place is situated just 9 kilometers from Madinah and is situated around 450 kilometers from Mecca.",
    "history": "Dhu al-Hulayfah was defined as the miqat for the people of Medina by Muhammad in the hadith in Sahih Bukhari, Book 25, Hadith 14, which was narrated by",
    "architecture": "The current mosque building was built during the reign of King Fahd. It is in the shape of a square of an area of approximately 6,000 square meters (65,000 ft2) inside a 36,000 m2 (388,000 ft2) square-shaped enclosure. It consists of two sets of galleries separated by a wide yard of approximately 1000 square meters (11,000 ft2). The galleries are shaped as arches ending with long domes. At the center of the mosque is spring of water housed inside a dome. The portion of the enclosure that does not include the mosque, measuring around 20,000 m2 (216,000 ft2), includes multiple restrooms and areas for changing into ihram and performing wudu. Most of the inner area is pathways, galleries and trees. All 13 domes are located on the roof of the mosque, while the 5 minarets are located around the enclosure. One of the mosque's minarets stands distinct from the others, square at the bottom but round at the top in a diagonal shape, rising to a height of 64 metres (210 ft). The mosque is built in an Islamic architectural style, with Mamluk and Byzantine influences.",
    "banner_img": "Hajj/01-hajj.png",
    "index": "0",
    "latitude": "24.4137",
    "longitude": "39.5430"
  },
  {
    "title": "Hajj (Meeqat)",
    "day": "0",
    "date": "",
    "sub_title": "Yalamlam",
    "desc": "Yalamlam (Arabic: يلملم) is the Miqat for the people of Yemen and those travelling to Makkah from the south. Pilgrims travelling from countries such as South Africa, Nigeria etc. will cross this Miqat.",
    "sub_desc": "Yalamlam is the name of a hill in the southern regions of Mecca (about 84 km from Mecca) and this is the Miqat of those who come from the southern parts of the Arabian Peninsula like Yemen to Mecca, also all people who pass that way can become Muhrim in there.",
    "history": "",
    "architecture": "Masjid Miqat Yalamlam (Arabic: مسجد ميقات يلملم) has a total area of 625 m2, accommodating approximately 1,500 worshippers. It is located 130 kilometres (81 miles) from Masjid al-Haram and 21 kilometres (13 miles) southwest of the old Miqat in al-Sadiah (Arabic: السعدية).",
    "banner_img": "Hajj/02-hajj.png",
    "index": "1",
    "latitude": "20.8406",
    "longitude": "40.1389"
  },
  {
    "title": "Hajj (Meeqat)",
    "day": "0",
    "date": "",
    "sub_title": "DhuZaat (Dhat) Irq",
    "desc": "Dhāt ʿIrq (Arabic:ذات عرق) is a way station and miqat of hajj on the way from Mecca to Kufa. In the Event of Karbala, there was a conversation between Imam al-Husayn (a) and Bishr b. Ghalib in this place. The sariyya of Dhat 'Irq occurred there. ",
    "sub_desc": "This is meeqat location from Iraq, Iran, and those traveling to Makkah from that general direction.",
    "history": "Sariyya Dhat 'Irq (sariyya Zayd b. Haritha, Sariyya Qirada) occurred in this place under the commandership of Zayd b. Haritha on Jumada II 3, 28 months after Hijra (November 21, 624). ",
    "architecture": "",
    "banner_img": "Hajj/03-hajj.png",
    "index": "2",
    "latitude": "",
    "longitude": ""
  },
  {
    "title": "Hajj (Meeqat)",
    "day": "0",
    "date": "",
    "sub_title": "Al Juhfah",
    "desc": "Al-Juhfah (Arabic:الجحفة) is one of the five miqats of hajj al-tamattu' and al-'umra al-mufrada. Those who go to Jeddah by airplane or ship, go to al-Juhfah and there they wear ihram. ",
    "sub_desc": "Juhfah is a place in the middle of the distance between Medina and Mecca, 150 km from Mecca, which is some distance from the main road, and this is the Miqat of people who come Hajj from Egypt, north of Africa, Syria, Jordan and Lebanon (road trip), also all persons who are passing from this way.",
    "history": "Due to its historical and religious location (being a miqat) and being on the way of commercial caravans, al-Juhfah has always been important. Reports suggest the development of al-Juhfah in first centuries of Islam. ",
    "architecture": "",
    "banner_img": "Hajj/04-hajj.png",
    "index": "3",
    "latitude": "27.0696",
    "longitude": "42.2313"
  },
  {
    "title": "Hajj (Meeqat)",
    "day": "0",
    "date": "",
    "sub_title": "Qarn Al-Manazil",
    "desc": "Miqat Qarn Al Manazil (Miqat Al-Sail Al-Kabir) is a monument in Saudi Arabia. Miqat Qarn Al Manazil (Miqat Al-Sail Al-Kabir) is situated nearby to Miqat Qarn al-Manazil Parking, and close to اسواق الميقات.",
    "sub_desc": "This is the meeqat point for the pilgrims coming from Najd and surrounding areas.",
    "history": "",
    "architecture": "",
    "banner_img": "Hajj/05-hajj.png",
    "index": "4",
    "latitude": "21.6332",
    "longitude": "40.4275"
  },
  {
    "title": "Day 1",
    "day": "1",
    "date": "8th Dhu al-Hijjah (Tarwiyah Day)",
    "sub_title": "Kaabah (Masjid al-Haram) - Tawaaf Al Qudum",
    "desc": "Masjid al-Haram (Arabic: اَلْمَسْجِدُ ٱلْحَرَامُ, romanized: al-Masjid al-Ḥarām, lit.'The Inviolable Mosque'), also known as the Great Mosque of Mecca, is a mosque that surrounds the Kaaba in Mecca, in the Mecca Province of Saudi Arabia. It is a site of pilgrimage in the Hajj, which every Muslim must do at least once in their lives if able, and is also the main phase for the ʿUmrah, the lesser pilgrimage that can be undertaken any time of the year. The rites of both pilgrimages include circumambulating the Kaaba within the mosque. The Great Mosque includes other important significant sites, including the Black Stone, the Zamzam Well, Maqam Ibrahim, and the hills of Safa and Marwa.",
    "sub_desc": "The Kaabah (The Cube), also known as Baitullah (House of Allah), is a cubical structure at the center of Masjid al-Haram in Makkah, considered to be the most sacred site in Islam.",
    "history": "The Great Mosque contends with the Mosque of the Companions in the Eritrean city of Massawa and Quba Mosque in Medina as the oldest mosque. Some scholars, who reference Islamic tradition and the Quran, explain that the Islamic perspective claims that Islam as a religion preceded Muhammad, representing previous prophets such as Abraham. Abraham is credited by Muslims with having built the Kaaba in Mecca, and consequently its sanctuary, which according to the Muslim view is seen as the first mosque that ever existed. According to other scholars, Islam started during the lifetime of Muhammad in the 7th century CE, and so did architectural components such as the mosque. In that case, either the Mosque of the Companions[20] or Quba Mosque would be the first mosque that was built in the history of Islam.",
    "architecture": "",
    "banner_img": "Hajj/06-hajj.png",
    "index": "5",
    "latitude": "21.4229",
    "longitude": "39.8257"
  },
  {
    "title": "Day 1",
    "day": "1",
    "date": "8th Dhu al-Hijjah (Tarwiyah Day)",
    "sub_title": "Maqām Ibrāhīm",
    "desc": "The Maqām Ibrāhīm (Arabic: مَقَام إِبْرَاهِيْم, lit. 'Station of Abraham') is a small square stone associated with Ibrahim (Abraham), Ismail (Ishmael) and their building of the Kaaba in what is now the Great Mosque of Mecca in the Hejazi region of Saudi Arabia. According to Islamic tradition, the imprint on the stone came from Abraham's feet.",
    "sub_desc": "Maqam Ibrahim a glass and metal enclosure with what is said to be an imprint of Prophet Abraham\\'s foot.",
    "history": "According to one tradition it appeared when Ibrahim stood on the stone while building the Kaaba; when the walls became too high, Ibrahim stood on the maqām, which miraculously rose up to let him continue building and also miraculously went down in order to allow Ismail to hand him stones. Other traditions held that the footprint appeared when the wife of Ismail washed Ibrahim's head, or alternatively when Ibrahim stood atop it in order to summon the people to perform the pilgrimage to Mecca.",
    "architecture": "The stone inside the casing is square shaped and measures 40 cm (16 in) in length and width, and 20 cm (7.9 in) in height. It used to be enclosed by a structure called the Maqsurat Ibrahim which was covered by a sitara: an ornamental, embroidered curtain that was replaced annually. Currently it is placed inside a golden-metal enclosure. The outer casing has changed a number of times over the years, historic photographs show that the arch of the Banu Shaybah Gate stood next to it.",
    "banner_img": "Hajj/07-hajj.png",
    "index": "6",
    "latitude": "21.6332",
    "longitude": "40.4275"
  },
  {
    "title": "Day 1",
    "day": "1",
    "date": "8th Dhu al-Hijjah (Tarwiyah Day)",
    "sub_title": "Safa",
    "desc": "The Safa and Marwa story is a clear depiction of Hajar's commitment to her son in such harsh circumstances and her unwavering devotion and faith in Allah. Pilgrims going to Hajj or Umrah remember this story and run forth and back between Safa and Marwa to commemorate Hajar's love for her son and belief in Allah.",
    "sub_desc": "Safa is a hill to the south of the Kaabah, which has now been leveled down.",
    "history": "The individual geological history of the two mountains is relatively unknown. Marwa has been described as smoother and lighter in color than Safa, with some even calling it white, such as Majd ad-Din Ferozabadi, az-Zubaidi, al-Fayoumi. al-Alusi further went on to say that Safa's color was comparable to a tint of red. Safa and Marwa are a part of the Hejaz mountain range, which run parallel to most of the Saudi coast on the Red Sea. The Hejaz themselves are part of the larger Sarawat range, which is characterized by young and jagged mountains.",
    "architecture": "Safa is a small mountain located at the bottom of the Abu Qubais Mountain, about 130 meters (430 ft) southeast of the Ka'bah, which is the beginning of the Sa'ee. As for Marwa, it is also a small mountain of white stone, located 300 meters (980 ft) to the northeast of the Ka'bah and it is connected to Qaiqan Mountain, marking the end of the Sa'ee.",
    "banner_img": "Hajj/08-hajj.png",
    "index": "7",
    "latitude": "21.4235",
    "longitude": "39.8274"
  },
  {
    "title": "Day 1",
    "day": "1",
    "date": "8th Dhu al-Hijjah (Tarwiyah Day)",
    "sub_title": "Marwa",
    "desc": "Safa and Marwa (Arabic: ٱلصَّفَا وَٱلْمَرْوَة, romanized: Aṣ-Ṣafā wal-Marwah) are two small hills, connected to the larger Abu Qubais and Qaiqan mountains, respectively, in Mecca, Saudi Arabia, now made part of the Masjid al-Haram. Muslims travel back and forth between them seven times in what is known as Sa'ee (Arabic: سَعِي, romanized: sa'iy, lit. 'seeking/searching or walking') ritual pilgrimages of Ḥajj and Umrah.",
    "sub_desc": "Marwah is the hill opposite Safa (to the north of the Kaabah).",
    "history": "The individual geological history of the two mountains is relatively unknown. Marwa has been described as smoother and lighter in color than Safa, with some even calling it white, such as Majd ad-Din Ferozabadi, az-Zubaidi, al-Fayoumi. al-Alusi further went on to say that Safa's color was comparable to a tint of red. Safa and Marwa are a part of the Hejaz mountain range, which run parallel to most of the Saudi coast on the Red Sea. The Hejaz themselves are part of the larger Sarawat range, which is characterized by young and jagged mountains.",
    "architecture": "",
    "banner_img": "Hajj/09-hajj.png",
    "index": "8",
    "latitude": "21.4235",
    "longitude": "40.4275"
  },
  {
    "title": "Day 1",
    "day": "1",
    "date": "8th Dhu al-Hijjah (Tarwiyah Day)",
    "sub_title": "Mina",
    "desc": "Mina (Arabic: مِنَى, romanized: Minā), also transliterated as Muna (Arabic: مُنَى, romanized: Munā), and commonly known as the 'City of Tents' is a valley and neighborhood located in the Masha'er district in the Makkah Province of Saudi Arabia, 8 kilometres (5 miles) southeast of the city of Mecca, covering an area of approximately 20 km2 (7.7 sq mi). Mina incorporates the tents, the Jamarat area, and the slaughterhouses just outside the tent city.",
    "sub_desc": "Mina is a valley surrounded by mountains, located to the east of Makkah approximately 6 kilometers away from Masjid al-Haram.",
    "history": "In Islamic tradition, Ibrahim left his wife, Hagar (Hagar) and their son, Isma'il, in the valley of Mecca when Ishmael was an infant. Upon one of his visits to his family in Mecca, he was ordered by Allah in a dream to sacrifice his son in the Mina valley. While carrying out his sacrifice, he was interrupted by a devil and was commanded by Allah to stone the devil. The ritual of the stoning of the Devil is a commemoration of this belief. Mina is also believed to be the location of the pledges of al-Aqabah.",
    "architecture": "Mina is situated in the eponymous Mina valley, at an elevation of approximately 400 m (1320 ft). It is bordered by the al-'Aziziyah district of Mecca in the west, the 4th Ring Road to the north, Muzdalifah to the east, and the al-Jami'ah district to the south. The westernmost features of Mina are the three Jamarat, which are stoned during the Stoning of the Devil. These are, the Jamarat al-Sughra', the westernmost and smallest, the Jamarat al-Wusta', the intermediary, and the Jamarat al-Kubra', also called Jamarat al-'Aqabah, the largest and easternmost. In a 2003 study, the distance between the first two was measured to be 135 m (443 ft) and the distance between the latter two was measured at 225 m (738 ft).[18] To the north-east of Mina are the slaughterhouses, where the sacrificial animals of the Hajj pilgrims are slaughtered. The Masjid al-Khayf (Arabic: مَسْجِد ٱلْخَيْف) is located in the centre of the Mina valley, and is active only during the Hajj. ",
    "banner_img": "Hajj/10-hajj.png",
    "index": "9",
    "latitude": "21.4146",
    "longitude": "39.8946"
  },
  {
    "title": "Day 2",
    "day": "2",
    "date": "9th Dhu al-Hijjah (Arafah Day)",
    "sub_title": "Mount Arafat",
    "desc": "Mount Arafat (Arabic: جَبَل عَرَفَات, romanized: Jabal ʿArafāt), and by its other Arabic name, Jabal ar-Raḥmah (Arabic: جَبَل ٱلرَّحْمَة, lit. 'mountain of mercy'), is a granodiorite hill about 20 km (12 mi) southeast of Mecca, in the province of the same name in Saudi Arabia. The mountain is approximately 70 m (230 ft) in height, with its highest point sitting at an elevation of 454 metres (1,490 feet). ",
    "sub_desc": "Arafat is a plain about 20 kilometers (12 miles) southeast of Makkah.",
    "history": "According to some Islamic traditions, the hill is the place where the Prophet Muhammad stood and delivered the Farewell Sermon, also known as the Khutbat al-Wada', to his Sahabah (Companions) who had accompanied him for the Hajj towards the end of his life. Some Muslims also believe that Mount Arafat is the place where Adam and Eve (Hawa) reunited on Earth after falling from Heaven, believing the mountain to be the place where they were forgiven, hence giving it the name Jabal ar-Rahmah, meaning 'Mountain of Mercy'. A pillar is erected on top of the mountain to show where this event is believed to have taken place. ",
    "architecture": "Mount Arafat is a granite hill about 20 km (12 mi) southeast of Mecca in the plain of Arafat. Mount Arafat reaches about 70 m (230 ft) in height and is known as the 'Mountain of Mercy' (Jabal ar-Rahmah).",
    "banner_img": "Hajj/11-hajj.png",
    "index": "10",
    "latitude": "21.3549",
    "longitude": "39.9841"
  },
  {
    "title": "Day 2",
    "day": "2",
    "date": "9th Dhu al-Hijjah (Arafah Day)",
    "sub_title": "Muzdalifah",
    "desc": "Muzdalifah (Arabic: مُزْدَلِفَة) is an open and level area near Mecca in the Hejazi region of Saudi Arabia that is associated with the Ḥajj 'Pilgrimage'. It lies just southeast of Mina, on the route between Mina and Arafat. ",
    "sub_desc": "After sunset, it\\'s time to move again, this time to Muzdalifah – a 9 km trip – where they spend the night under the stars. Many will also begin collecting pebbles here for tomorrow\\'s rites, departing again just before sunrise.",
    "history": "During the farewell Hajj, the Prophet performed the Maghrib and Isha salats together here. He stayed at the spot where the present Masjid Mash’arul Haram currently is (towards the Qibla side). From there, the Prophet said:“Although I am staying here, you may stay anywhere throughout Muzdalifah.”",
    "architecture": "Muzdalifah stretches from the Valley of Muhassar to the mountains of Ma’zamayn. It is four kilometres long and covers an area of 12.25 square kilometers.",
    "banner_img": "Hajj/12-hajj.png",
    "index": "11",
    "latitude": "21.2433",
    "longitude": "39.5411"
  },
  {
    "title": "Day 3",
    "day": "3",
    "date": "10th Dhu al-Hijjah (Qurban Day)",
    "sub_title": "Mina (Jamraat al Aqaba)",
    "desc": "The Stoning of the Devil (Arabic: رمي الجمرات ramy al-jamarāt, lit. 'throwing of the jamarāt [place of pebbles]') is part of the annual Islamic Hajj pilgrimage to the holy city of Mecca in Saudi Arabia. During the ritual, Muslim pilgrims throw pebbles at three walls (formerly pillars), called jamarāt, in the city of Mina just east of Mecca. It is one of a series of ritual acts that must be performed in the Hajj. It is a symbolic reenactment of Ibrahim's (or Abraham's) hajj, where he stoned three pillars representing the temptation to disobey God. ",
    "sub_desc": "From the direction of Mina, the last of three pillars is the Jamraat al-Aqaba.",
    "history": "When he [Abraham] left Mina and was brought down to (the defile called) al-Aqaba, the Devil appeared to him at Stone-Heap of the Defile. Gabriel (Jibrayil) said to him: 'Pelt him!' so Abraham threw seven stones at him so that he disappeared from him. Then he appeared to him at the Middle Stone-Heap. Gabriel said to him: 'Pelt him!' so he pelted him with seven stones so that he disappeared from him. Then he appeared to him at the Little Stone-Heap. Gabriel said to him: 'Pelt him!' so he pelted him with seven stones like the little stones for throwing with a sling. So the Devil withdrew from him.",
    "architecture": "",
    "banner_img": "Hajj/13-hajj.png",
    "index": "11",
    "latitude": "",
    "longitude": ""
  },
  {
    "title": "Day 3",
    "day": "3",
    "date": "10th Dhu al-Hijjah (Qurban Day)",
    "sub_title": "Kabaah (Masjid al-Haram)",
    "desc": "Great Mosque of Mecca, Arabic al-Masjid al-Ḥarām, also called Holy Mosque or Haram Mosque, mosque in Mecca, Saudi Arabia, built to enclose the Kaʿbah, the holiest shrine in Islam. As one of the destinations of the hajj and ʿumrah pilgrimages, it receives millions of worshippers each year. The oldest parts of the modern structure date to the 16th century.",
    "sub_desc": "Muslims are expected to face the Kabaah during each Salah and is also integral to the rite of Tawaf, where it is encircled by pilgrims performing Hajj.",
    "history": "The Great Mosque contends with the Mosque of the Companions in the Eritrean city of Massawa and Quba Mosque in Medina as the oldest mosque. Some scholars, who reference Islamic tradition and the Quran, explain that the Islamic perspective claims that Islam as a religion preceded Muhammad, representing previous prophets such as Abraham. Abraham is credited by Muslims with having built the Kaaba in Mecca, and consequently its sanctuary, which according to the Muslim view is seen as the first mosque that ever existed.[ According to other scholars, Islam started during the lifetime of Muhammad in the 7th century CE, and so did architectural components such as the mosque. In that case, either the Mosque of the Companions or Quba Mosque would be the first mosque that was built in the history of Islam.",
    "architecture": "",
    "banner_img": "Hajj/14-hajj.png",
    "index": "12",
    "latitude": "21.4229",
    "longitude": "39.8257"
  },
  {
    "title": "Day 4-6",
    "day": "4-6",
    "date": "11th - 13th Dhu al-Hijjah",
    "sub_title": "Mina",
    "desc": "Mina (Arabic: مِنَى, romanized: Minā), also transliterated as Muna (Arabic: مُنَى, romanized: Munā), and commonly known as the 'City of Tents' is a valley and neighborhood located in the Masha'er district in the Makkah Province of Saudi Arabia, 8 kilometres (5 miles) southeast of the city of Mecca, covering an area of approximately 20 km2 (7.7 sq mi). Mina incorporates the tents, the Jamarat area, and the slaughterhouses just outside the tent city.",
    "sub_desc": "On each day, they will again symbolically stone the devil – this time throwing seven pebbles at each of the three pillars. With the hardest part behind them, pilgrims will now spend the next two or three days in Mina.",
    "history": "In Islamic tradition, Ibrahim left his wife, Hagar (Hagar) and their son, Isma'il, in the valley of Mecca when Ishmael was an infant. Upon one of his visits to his family in Mecca, he was ordered by Allah in a dream to sacrifice his son in the Mina valley. While carrying out his sacrifice, he was interrupted by a devil and was commanded by Allah to stone the devil. The ritual of the stoning of the Devil is a commemoration of this belief. Mina is also believed to be the location of the pledges of al-Aqabah.",
    "architecture": "Mina is situated in the eponymous Mina valley, at an elevation of approximately 400 m (1320 ft). It is bordered by the al-'Aziziyah district of Mecca in the west, the 4th Ring Road to the north, Muzdalifah to the east, and the al-Jami'ah district to the south. The westernmost features of Mina are the three Jamarat, which are stoned during the Stoning of the Devil. These are, the Jamarat al-Sughra', the westernmost and smallest, the Jamarat al-Wusta', the intermediary, and the Jamarat al-Kubra', also called Jamarat al-'Aqabah, the largest and easternmost. In a 2003 study, the distance between the first two was measured to be 135 m (443 ft) and the distance between the latter two was measured at 225 m (738 ft).[18] To the north-east of Mina are the slaughterhouses, where the sacrificial animals of the Hajj pilgrims are slaughtered. The Masjid al-Khayf (Arabic: مَسْجِد ٱلْخَيْف) is located in the centre of the Mina valley, and is active only during the Hajj. ",
    "banner_img": "Hajj/15-hajj.png",
    "index": "13",
    "latitude": "21.4146",
    "longitude": "39.8946"
  },
  {
    "title": "Day 4-6",
    "day": "4-6",
    "date": "11th - 13th Dhu al-Hijjah",
    "sub_title": "Kabaah (Masjid al-Haram)",
    "desc": "Great Mosque of Mecca, Arabic al-Masjid al-Ḥarām, also called Holy Mosque or Haram Mosque, mosque in Mecca, Saudi Arabia, built to enclose the Kaʿbah, the holiest shrine in Islam. As one of the destinations of the hajj and ʿumrah pilgrimages, it receives millions of worshippers each year. The oldest parts of the modern structure date to the 16th century.",
    "sub_desc": "Pilgrims return to Mecca to perform the final circulation of the Kaaba, for “farewell” tawaf.",
    "history": "The Great Mosque contends with the Mosque of the Companions in the Eritrean city of Massawa and Quba Mosque in Medina as the oldest mosque. Some scholars, who reference Islamic tradition and the Quran, explain that the Islamic perspective claims that Islam as a religion preceded Muhammad, representing previous prophets such as Abraham. Abraham is credited by Muslims with having built the Kaaba in Mecca, and consequently its sanctuary, which according to the Muslim view is seen as the first mosque that ever existed.[ According to other scholars, Islam started during the lifetime of Muhammad in the 7th century CE, and so did architectural components such as the mosque. In that case, either the Mosque of the Companions or Quba Mosque would be the first mosque that was built in the history of Islam.",
    "architecture": "",
    "banner_img": "Hajj/16-hajj.png",
    "index": "14",
    "latitude": "21.4229",
    "longitude": "39.8257"
  }
]
